In [1]:
#libraries to use
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import datetime as dt
#python's lxml library parses xml and html files
from lxml import html

#use requests to get data from web pages
import requests 

#use requests.get() to get web page with data
page = requests.get('https://tennstate_ftp.sidearmsports.com/custompages/tsutigers/A5FB3AA1-8151-496A-A022-754FE722F59E/teamgbg.htm')

#parse data on web page using html module.fromstring
mytree = html.fromstring(page.content)

#go to web address above , right click on page and select inspect to get HTML code for data from right side of page
#create XPath query and use xpath function to get data
#date data
date = mytree.xpath('body/center//tr/td/font[@color="#000000"]/text()')[1:120:10]
date=[a.replace("\xa0","") for a in date]
date=[a.replace('Sep. 6, 2003','Sep 06 2003') for a in date]
date=[a.replace(",","") for a in date]
date

['Aug 30 2003',
 'Sep 06 2003',
 'Sep 13 2003',
 'Sep 20 2003',
 'Sep 27 2003',
 'Oct 11 2003',
 'Oct 18 2003',
 'Oct 25 2003',
 'Nov 01 2003',
 'Nov 08 2003',
 'Nov 15 2003',
 'Nov 22 2003']

In [4]:
#get attendance data
attendance=mytree.xpath('body/center//tr/td/font[@color="#000000"]/text()')[9:120:10]
attendance=[a.replace("\xa0","") for a in attendance]
attendance=[a.strip() for a in attendance]
attendance

['18124',
 '18085',
 '52603',
 '70185',
 '8434',
 '8127',
 '8023',
 '10360',
 '25037',
 '5375',
 '3875',
 '2814']

In [5]:
#get TSU rushing yards
TSUrushyards=mytree.xpath('body/center//tr/td/font[@color="#000000"]/text()')[124:380:23]
TSUrushyards=[a.replace("\xa0","") for a in TSUrushyards]
TSUrushyards

['113',
 '141',
 '209',
 '153',
 '142',
 '182',
 '47',
 '132',
 '223',
 '149',
 '144',
 '191']

In [6]:
#get TSU receiving yards
TSUreceiveyards=mytree.xpath('body/center//tr/td/font[@color="#000000"]/text()')[128:400:23]
TSUreceiveyards=[a.replace("\xa0","") for a in TSUreceiveyards]
TSUreceiveyards

['365',
 '146',
 '132',
 '138',
 '285',
 '297',
 '175',
 '271',
 '184',
 '196',
 '371',
 '195']

In [7]:
#get TSU kick return yards
TSUkreturnyards=mytree.xpath('body/center//tr/td/font[@color="#000000"]/text()')[136:400:23]
TSUkreturnyards=[a.replace("\xa0","") for a in TSUkreturnyards]
TSUkreturnyards

['69', '147', '138', '86', '11', '33', '90', '50', '8', '139', '112', '63']

In [8]:
#get TSU punt return yards
TSUpreturnyards=mytree.xpath('body/center//tr/td/font[@color="#000000"]/text()')[140:400:23]
TSUpreturnyards=[a.replace("\xa0","") for a in TSUpreturnyards]
TSUpreturnyards

['88', '8', '107', '2', '29', '52', '-17', '45', '9', '18', '0', '15']

In [9]:
#get TSU total tackles
TSUtackles=mytree.xpath('body/center//tr/td/font[@color="#000000"]/text()')[447:700:22]
TSUtackles=[a.replace("\xa0","") for a in TSUtackles]
TSUtackles

['69', '68', '84', '50', '76', '74', '79', '83', '65', '65', '75', '67']

In [10]:
#get TSU tackle yards
TSUtackleyd=mytree.xpath('body/center//tr/td/font[@color="#000000"]/text()')[449:700:22]
TSUtackleyd=[a.replace("\xa0","") for a in TSUtackleyd]
TSUtackleyd

['33', '22', '26', '22', '46', '44', '9', '34', '23', '23', '32', '37']

In [11]:
#get TSU sacks
TSUsacks=mytree.xpath('body/center//tr/td/font[@color="#000000"]/text()')[450:700:22]
TSUsacks=[a.replace("\xa0","") for a in TSUsacks]
TSUsacks

['3.0',
 '0.0',
 '1.0',
 '0.0',
 '4.0',
 '4.0',
 '1.0',
 '2.0',
 '2.0',
 '2.0',
 '4.0',
 '5.0']

In [12]:
#get TSU sack yards
TSUsackyd=mytree.xpath('body/center//tr/td/font[@color="#000000"]/text()')[451:700:22]
TSUsackyd=[a.replace("\xa0","") for a in TSUsackyd]
TSUsackyd

['21', '0', '4', '0', '22', '30', '9', '24', '12', '14', '20', '28']

In [13]:
#TSU punts
TSUpunt=mytree.xpath('body/center//tr/td/font[@color="#000000"]/text()')[753:969:19]
TSUpunt=[a.replace("\xa0","") for a in TSUpunt]
TSUpunt

['5', '7', '5', '6', '3', '2', '6', '8', '5', '5', '10', '7']

In [14]:
#create data frame
#change dictionary of lists to data frame
list_of_dicts={'date':date,
     'attendance':attendance,
     'TSUrushyards':TSUrushyards,
     'TSUreceiveyards':TSUreceiveyards,
     'TSUkreturnyards':TSUkreturnyards,
     'TSUpreturnyards':TSUpreturnyards,
     'TSUtackles':TSUtackles,
     'TSUtackleyd':TSUtackleyd,
     'TSUsacks':TSUsacks,
     'TSUsackyd':TSUsackyd,
     'TSUpunt':TSUpunt}
df2003=pd.DataFrame(list_of_dicts)
df2003.head()

,date,attendance,TSUrushyards,TSUreceiveyards,TSUkreturnyards,TSUpreturnyards,TSUtackles,TSUtackleyd,TSUsacks,TSUsackyd,TSUpunt
0,Aug 30 2003,18124,113,365,69,88,69,33,3.0,21,5
1,Sep 06 2003,18085,141,146,147,8,68,22,0.0,0,7
2,Sep 13 2003,52603,209,132,138,107,84,26,1.0,4,5
3,Sep 20 2003,70185,153,138,86,2,50,22,0.0,0,6
4,Sep 27 2003,8434,142,285,11,29,76,46,4.0,22,3

In [15]:

#splitting date column into month, day, & year columns 
df2003[['month','day','year']]=df2003.date.str.split(expand=True)
df2003.drop('date',axis=1)
df2003.head()

,date,attendance,TSUrushyards,TSUreceiveyards,TSUkreturnyards,TSUpreturnyards,TSUtackles,TSUtackleyd,TSUsacks,TSUsackyd,TSUpunt,month,day,year
0,Aug 30 2003,18124,113,365,69,88,69,33,3.0,21,5,Aug,30,2003
1,Sep 06 2003,18085,141,146,147,8,68,22,0.0,0,7,Sep,06,2003
2,Sep 13 2003,52603,209,132,138,107,84,26,1.0,4,5,Sep,13,2003
3,Sep 20 2003,70185,153,138,86,2,50,22,0.0,0,6,Sep,20,2003
4,Sep 27 2003,8434,142,285,11,29,76,46,4.0,22,3,Sep,27,2003

In [16]:
#create a new date variable
#change month variable to a 2 digit string variable
df2003['month'] = df2003['month'].str.replace('Aug','08')
df2003['month'] = df2003['month'].str.replace('Sep','09')
df2003['month'] = df2003['month'].str.replace('Oct','10')
df2003['month'] = df2003['month'].str.replace('Nov','11')
df2003['month'] = df2003['month'].str.replace('Dec','12')
#merge month,day and year variables
df2003['date']=df2003['year']+ '-' +df2003['month']+ '-'+df2003['day']
#make date into a datetime variable
df2003['date']= pd.to_datetime(df2003['date'], format='%Y-%m-%d')
#drop individual month,day, variables (keep year variable for later analysis)
df2003=df2003.drop(['month','day'], axis=1)
#make year numeric
df2003['year']=pd.to_numeric(df2003['year'])
df2003.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 12 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   date             12 non-null     datetime64[ns]
 1   attendance       12 non-null     object
 2   TSUrushyards     12 non-null     object
 3   TSUreceiveyards  12 non-null     object
 4   TSUkreturnyards  12 non-null     object
 5   TSUpreturnyards  12 non-null     object
 6   TSUtackles       12 non-null     object
 7   TSUtackleyd      12 non-null     object
 8   TSUsacks         12 non-null     object
 9   TSUsackyd        12 non-null     object
 10  TSUpunt          12 non-null     object
 11  year             12 non-null     int64
dtypes: datetime64[ns](1), int64(1), object(10)
memory usage: 1.2+ KB